-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/michaelsanders/Documents/Homelessness QED/Mockingbird_CEM.log
  log type:  text
 opened on:  11 Jan 2023, 19:28:13

. keep if year==2021
(1,609 observations deleted)

. tab year

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        309      100.00      100.00
------------+-----------------------------------
      Total |        309      100.00

. **First stab
. cem oldercl change5_21p change4_21p change3_21p change2_21p change1_21p employmentscore incomescore IDACIscore, treatment(mockingbird) 

Matching Summary:
-----------------
Number of strata: 196
Number of matched strata: 21

             0    1
      All  260   49
  Matched   52   23
Unmatched  208   26


Multivariate L1 distance: .91304348

Univariate imbalance:

                      L1     mean      min      25%      50%      75%      max
        oldercl   .12101  -.11087        0        0       -1        1        .
    change5_21p  1.1e-16  1.1e-16        0        0        0        0        .
    change4_21p  1.1e-16  1.1e-16        0        0        0        0        .
    change3_21p   .13043   .04407        0   .15789  -.17703        0        .
    change2_21p   .17464  -.11019        0   -.1875  -.14286  -.33333        .
    change1_21p   .19855  -.12801        0  -.19608  -.14103  -.16667        .
employmentscore    .1529  -.00376     .005    -.003     -.01     .003    -.013
    incomescore    .0971  -.00221     .001    -.006    -.004     .005     .008
     IDACIscore   .28116  -.00279     .002     -.01    -.012     .005      .02

. **Outcomes**
. local outcomes youngpersonaged1617years careleaveraged1820years vulnerableasaresultofhavingbeeni

. foreach x of local outcomes{
  2. reg `x' mockingbird careleavers21plus if cem_matched==1
  3. }

      Source |       SS           df       MS      Number of obs   =        75
-------------+----------------------------------   F(2, 72)        =      6.79
       Model |  504.011132         2  252.005566   Prob > F        =    0.0020
    Residual |  2671.53553        72  37.1046602   R-squared       =    0.1587
-------------+----------------------------------   Adj R-squared   =    0.1353
       Total |  3175.54667        74  42.9127928   Root MSE        =    6.0914

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   2.208451   1.526342     1.45   0.152    -.8342555    5.251158
careleavers21plus |   .3409623   .0991514     3.44   0.001     .1433075    .5386171
            _cons |   2.574847   1.042041     2.47   0.016     .4975761    4.652118
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        75
-------------+----------------------------------   F(2, 72)        =     43.33
       Model |  2924.45389         2  1462.22694   Prob > F        =    0.0000
    Residual |  2429.49278        72  33.7429553   R-squared       =    0.5462
-------------+----------------------------------   Adj R-squared   =    0.5336
       Total |  5353.94667        74  72.3506306   Root MSE        =    5.8089

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   1.568613   1.455557     1.08   0.285    -1.332986    4.470212
careleavers21plus |   .8773948   .0945532     9.28   0.000     .6889064    1.065883
            _cons |   2.292955   .9937158     2.31   0.024      .312019    4.273891
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        75
-------------+----------------------------------   F(2, 72)        =    197.19
       Model |  13307.4939         2  6653.74694   Prob > F        =    0.0000
    Residual |  2429.49278        72  33.7429553   R-squared       =    0.8456
-------------+----------------------------------   Adj R-squared   =    0.8413
       Total |  15736.9867        74  212.661982   Root MSE        =    5.8089

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   1.568613   1.455557     1.08   0.285    -1.332986    4.470212
careleavers21plus |   1.877395   .0945532    19.86   0.000     1.688906    2.065883
            _cons |   2.292955   .9937158     2.31   0.024      .312019    4.273891
-----------------------------------------------------------------------------------

. gen matched1 = cem_matched==1

. gen mockingbird2 = mockingbird==1 & cem_matched==0

. 
. cem oldercl changeall_21p employmentscore incomescore IDACIscore , treatment(mockingbird2) 

Matching Summary:
-----------------
Number of strata: 105
Number of matched strata: 12

             0    1
      All  283   26
  Matched   97   15
Unmatched  186   11


Multivariate L1 distance: .70192374

Univariate imbalance:

                      L1     mean      min      25%      50%      75%      max
        oldercl   .16946  -.35623        0        0        0        2        0
  changeall_21p   .11579   .16983        0   .09524      .38        .        .
employmentscore   .15064    -.001        0    -.003    -.005     .002    -.008
    incomescore   .04444  -.00203        0    -.001    -.001        0    -.002
     IDACIscore   .10099  -.00392     .004    -.005    -.008    -.004    -.004

. foreach x of local outcomes{
  2. reg `x' mockingbird careleavers21plus if cem_matched==1
  3. }

      Source |       SS           df       MS      Number of obs   =       112
-------------+----------------------------------   F(2, 109)       =     19.19
       Model |  1647.86028         2  823.930138   Prob > F        =    0.0000
    Residual |  4680.41651       109   42.939601   R-squared       =    0.2604
-------------+----------------------------------   Adj R-squared   =    0.2468
       Total |  6328.27679       111  57.0115026   Root MSE        =    6.5528

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   .8690329   1.429966     0.61   0.545    -1.965113    3.703179
careleavers21plus |   .4998452   .0810363     6.17   0.000     .3392339    .6604566
            _cons |   2.113989   .8544619     2.47   0.015     .4204731    3.807504
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =       112
-------------+----------------------------------   F(2, 109)       =     72.53
       Model |  3373.02177         2  1686.51088   Prob > F        =    0.0000
    Residual |  2534.69252       109  23.2540598   R-squared       =    0.5710
-------------+----------------------------------   Adj R-squared   =    0.5631
       Total |  5907.71429       111  53.2226512   Root MSE        =    4.8222

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |  -2.170768   1.052316    -2.06   0.042    -4.256424   -.0851123
careleavers21plus |   .7069366   .0596348    11.85   0.000     .5887423    .8251309
            _cons |   3.120664   .6288008     4.96   0.000     1.874401    4.366926
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =       112
-------------+----------------------------------   F(2, 109)       =    412.10
       Model |  19166.0218         2  9583.01088   Prob > F        =    0.0000
    Residual |  2534.69252       109  23.2540598   R-squared       =    0.8832
-------------+----------------------------------   Adj R-squared   =    0.8811
       Total |  21700.7143       111  195.501931   Root MSE        =    4.8222

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |  -2.170768   1.052316    -2.06   0.042    -4.256424   -.0851123
careleavers21plus |   1.706937   .0596348    28.62   0.000     1.588742    1.825131
            _cons |   3.120664   .6288008     4.96   0.000     1.874401    4.366926
-----------------------------------------------------------------------------------

. gen matched2 = cem_matched==1

. gen mockingbird3 = mockingbird==1 & cem_matched==0 & matched1==0

. 
. cem  employmentscore incomescore IDACIscore , treatment(mockingbird3) 

Matching Summary:
-----------------
Number of strata: 57
Number of matched strata: 8

             0    1
      All  298   11
  Matched   63    8
Unmatched  235    3


Multivariate L1 distance: .4375

Univariate imbalance:

                      L1     mean      min      25%      50%      75%      max
employmentscore   .21429  -.00258     .012    -.019    -.008    -.008        0
    incomescore    .0625  -.00044     .004    -.013    -.003    -.003    -.014
     IDACIscore     .125  -.00219     .006    -.017    -.002    -.006        0

. foreach x of local outcomes{
  2. reg `x' mockingbird careleavers21plus if cem_matched==1 
  3. }

      Source |       SS           df       MS      Number of obs   =        71
-------------+----------------------------------   F(2, 68)        =     17.30
       Model |  6424.69946         2  3212.34973   Prob > F        =    0.0000
    Residual |  12623.6104        68  185.641329   R-squared       =    0.3373
-------------+----------------------------------   Adj R-squared   =    0.3178
       Total |  19048.3099        70  272.118712   Root MSE        =    13.625

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   4.904749   3.558773     1.38   0.173    -2.196671    12.00617
careleavers21plus |   .3933629   .0706951     5.56   0.000     .2522931    .5344327
            _cons |   2.336991   2.094118     1.12   0.268    -1.841757    6.515738
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        71
-------------+----------------------------------   F(2, 68)        =     52.60
       Model |   5910.9399         2  2955.46995   Prob > F        =    0.0000
    Residual |  3820.63756        68  56.1858465   R-squared       =    0.6074
-------------+----------------------------------   Adj R-squared   =    0.5959
       Total |  9731.57746        70  139.022535   Root MSE        =    7.4957

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   -2.32964   1.957836    -1.19   0.238    -6.236441    1.577162
careleavers21plus |   .3988172   .0388924    10.25   0.000     .3212086    .4764259
            _cons |    6.05372   1.152066     5.25   0.000     3.754809    8.352631
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        71
-------------+----------------------------------   F(2, 68)        =    649.21
       Model |  72952.9399         2    36476.47   Prob > F        =    0.0000
    Residual |  3820.63756        68  56.1858465   R-squared       =    0.9502
-------------+----------------------------------   Adj R-squared   =    0.9488
       Total |  76773.5775        70  1096.76539   Root MSE        =    7.4957

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      mockingbird |   -2.32964   1.957836    -1.19   0.238    -6.236441    1.577162
careleavers21plus |   1.398817   .0388924    35.97   0.000     1.321209    1.476426
            _cons |    6.05372   1.152066     5.25   0.000     3.754809    8.352631
-----------------------------------------------------------------------------------

. gen matched3 = cem_matched==1

. **Keep only variables for merging**
. keep matched1 matched2 matched3 LAgroup 

. **Save matched dataset
. save  "Homelessness_QED_Mockingbird_CEM1.dta", replace
file Homelessness_QED_Mockingbird_CEM1.dta saved

. **Merge in outcomes dataset**
. merge 1:m LAgroup using "Outcomes_clean_QED.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            93
        from master                         0  (_merge==1)
        from using                         93  (_merge==2)

    matched                             1,825  (_merge==3)
    -----------------------------------------

. save "Mockingbird_Analysis.dta", replace
file Mockingbird_Analysis.dta saved

. log close 
      name:  <unnamed>
       log:  /Users/michaelsanders/Documents/Homelessness QED/Mockingbird_CEM.log
  log type:  text
 closed on:  11 Jan 2023, 19:28:13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
