-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/michaelsanders/Documents/Homelessness QED/Staying-Put_CEM.log
  log type:  text
 opened on:  11 Jan 2023, 19:28:13

. keep if year==2021
(1,609 observations deleted)

. tab year

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |        309      100.00      100.00
------------+-----------------------------------
      Total |        309      100.00

. **First stab
. cem oldercl change5_21p change4_21p change3_21p change2_21p change1_21p employmentscore incomescore IDACIscore, treatment(stayingput) 

Matching Summary:
-----------------
Number of strata: 196
Number of matched strata: 12

             0    1
      All  282   27
  Matched   38   14
Unmatched  244   13


Multivariate L1 distance: .79795918

Univariate imbalance:

                       L1      mean       min       25%       50%       75%       max
        oldercl    .15204   -.24694         0         1        -1         4         .
    change5_21p   1.2e-16  -2.2e-16         0         0         0         0         .
    change4_21p   1.2e-16  -2.2e-16         0         0         0         0         .
    change3_21p    .07143   -.05584         0   -.31746   -.06667   -.33333         .
    change2_21p    .19184    .13733    .23214    .33333         0    .34615         .
    change1_21p    .14286    .18012       .25    .26667         0   -.08333         .
employmentscore    .12857    .00176      .007      .003         0      .005     -.004
    incomescore    .05714    .00078      .003      .004      .003      .006     -.001
     IDACIscore    .02857    .00352      .002     -.001      .002      .015     -.007

. **Outcomes**
. local outcomes youngpersonaged1617years careleaveraged1820years vulnerableasaresultofhavingbeeni

. foreach x of local outcomes{
  2. reg `x' stayingput careleavers21plus if cem_matched==1
  3. }

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(2, 49)        =     58.68
       Model |  17392.9479         2  8696.47397   Prob > F        =    0.0000
    Residual |  7262.03283        49  148.204752   R-squared       =    0.7055
-------------+----------------------------------   Adj R-squared   =    0.6934
       Total |  24654.9808        51  483.430995   Root MSE        =    12.174

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -5.316957   3.845238    -1.38   0.173    -13.04425    2.410339
careleavers21plus |   1.696033   .1565765    10.83   0.000     1.381381    2.010685
            _cons |  -3.699381   2.242821    -1.65   0.105    -8.206499    .8077372
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(2, 49)        =     73.80
       Model |  3951.12982         2  1975.56491   Prob > F        =    0.0000
    Residual |  1311.69711        49  26.7693287   R-squared       =    0.7508
-------------+----------------------------------   Adj R-squared   =    0.7406
       Total |  5262.82692        51  103.192685   Root MSE        =    5.1739

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -1.728188   1.634222    -1.06   0.295    -5.012279    1.555903
careleavers21plus |   .8072022   .0665448    12.13   0.000     .6734753     .940929
            _cons |    3.28268   .9531963     3.44   0.001      1.36716      5.1982
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        52
-------------+----------------------------------   F(2, 49)        =    372.80
       Model |   19958.976         2  9979.48799   Prob > F        =    0.0000
    Residual |  1311.69711        49  26.7693287   R-squared       =    0.9383
-------------+----------------------------------   Adj R-squared   =    0.9358
       Total |  21270.6731        51  417.072021   Root MSE        =    5.1739

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -1.728188   1.634222    -1.06   0.295    -5.012279    1.555903
careleavers21plus |   1.807202   .0665448    27.16   0.000     1.673475    1.940929
            _cons |    3.28268   .9531963     3.44   0.001      1.36716      5.1982
-----------------------------------------------------------------------------------

. gen matched1 = cem_matched==1

. gen stayingput2 = stayingput==1 & cem_matched==0

. 
. cem oldercl changeall_21p employmentscore incomescore IDACIscore , treatment(stayingput2) 

Matching Summary:
-----------------
Number of strata: 105
Number of matched strata: 6

             0    1
      All  296   13
  Matched   38    8
Unmatched  258    5


Multivariate L1 distance: .96286232

Univariate imbalance:

                      L1     mean      min      25%      50%      75%      max
        oldercl    .1558   -2.567        0       -2       -2       -4      -12
  changeall_21p   .08696   -.1779        0     -.25  -.06349  -.33333  -1.3333
employmentscore   .30072  -.00282     .011    -.002    -.007    -.001    -.009
    incomescore   .23551  -.00079     .001    -.007    -.005     .001    -.004
     IDACIscore   .16123  -.00391    -.017    -.006    -.015    -.004    -.001

. foreach x of local outcomes{
  2. reg `x' stayingput careleavers21plus if cem_matched==1
  3. }

      Source |       SS           df       MS      Number of obs   =        46
-------------+----------------------------------   F(2, 43)        =      0.29
       Model |  21.9260356         2  10.9630178   Prob > F        =    0.7520
    Residual |  1642.94353        43  38.2079891   R-squared       =    0.0132
-------------+----------------------------------   Adj R-squared   =   -0.0327
       Total |  1664.86957        45  36.9971014   Root MSE        =    6.1813

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |   .7164399   2.186538     0.33   0.745    -3.693135    5.126015
careleavers21plus |   .1594067   .2162821     0.74   0.465    -.2767677    .5955812
            _cons |   4.365286    1.51261     2.89   0.006     1.314817    7.415754
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        46
-------------+----------------------------------   F(2, 43)        =     17.36
       Model |   422.12918         2   211.06459   Prob > F        =    0.0000
    Residual |  522.827342        43  12.1587754   R-squared       =    0.4467
-------------+----------------------------------   Adj R-squared   =    0.4210
       Total |  944.956522        45  20.9990338   Root MSE        =    3.4869

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -2.837607    1.23346    -2.30   0.026    -5.325116   -.3500989
careleavers21plus |   .5870873    .122008     4.81   0.000     .3410347      .83314
            _cons |   4.402444   .8532863     5.16   0.000     2.681628     6.12326
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        46
-------------+----------------------------------   F(2, 43)        =     98.04
       Model |  2383.97701         2   1191.9885   Prob > F        =    0.0000
    Residual |  522.827342        43  12.1587754   R-squared       =    0.8201
-------------+----------------------------------   Adj R-squared   =    0.8118
       Total |  2906.80435        45  64.5956522   Root MSE        =    3.4869

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -2.837607    1.23346    -2.30   0.026    -5.325116   -.3500989
careleavers21plus |   1.587087    .122008    13.01   0.000     1.341035     1.83314
            _cons |   4.402444   .8532863     5.16   0.000     2.681628     6.12326
-----------------------------------------------------------------------------------

. gen matched2 = cem_matched==1

. gen stayingput3 = stayingput==1 & cem_matched==0 & matched1==0

. 
. cem  employmentscore incomescore IDACIscore , treatment(stayingput3) 

Matching Summary:
-----------------
Number of strata: 57
Number of matched strata: 4

             0    1
      All  304    5
  Matched   64    4
Unmatched  240    1


Multivariate L1 distance: .54402129

Univariate imbalance:

                     L1    mean     min     25%     50%     75%     max
employmentscore  .22369  .00257    .012   -.008    .002   -.026   -.002
    incomescore  .18182  .00113    .004   -.021   -.022    .006   -.003
     IDACIscore  .32955  .00161    .006   -.025   -.019   -.015    .001

. foreach x of local outcomes{
  2. reg `x' stayingput careleavers21plus if cem_matched==1 
  3. }

      Source |       SS           df       MS      Number of obs   =        67
-------------+----------------------------------   F(2, 64)        =     17.68
       Model |  1947.41631         2  973.708154   Prob > F        =    0.0000
    Residual |   3525.0613        64  55.0790829   R-squared       =    0.3559
-------------+----------------------------------   Adj R-squared   =    0.3357
       Total |  5472.47761        66  82.9163275   Root MSE        =    7.4215

-----------------------------------------------------------------------------------
youngpersonaged~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -1.007786   2.495967    -0.40   0.688    -5.994054    3.978482
careleavers21plus |   .3815931   .0663701     5.75   0.000     .2490035    .5141827
            _cons |   3.062325   1.136837     2.69   0.009     .7912315    5.333419
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        67
-------------+----------------------------------   F(2, 64)        =     67.39
       Model |  4425.11496         2  2212.55748   Prob > F        =    0.0000
    Residual |  2101.18354        64  32.8309929   R-squared       =    0.6780
-------------+----------------------------------   Adj R-squared   =    0.6680
       Total |  6526.29851        66  98.8833107   Root MSE        =    5.7298

-----------------------------------------------------------------------------------
careleaveraged1~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -1.659359   1.927026    -0.86   0.392    -5.509036    2.190317
careleavers21plus |   .5761612   .0512415    11.24   0.000     .4737947    .6785278
            _cons |   3.790108   .8777018     4.32   0.000     2.036697    5.543519
-----------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        67
-------------+----------------------------------   F(2, 64)        =    518.06
       Model |  34016.8463         2  17008.4232   Prob > F        =    0.0000
    Residual |  2101.18354        64  32.8309929   R-squared       =    0.9418
-------------+----------------------------------   Adj R-squared   =    0.9400
       Total |  36118.0299        66  547.242877   Root MSE        =    5.7298

-----------------------------------------------------------------------------------
vulnerableasare~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
       stayingput |  -1.659359   1.927026    -0.86   0.392    -5.509036    2.190317
careleavers21plus |   1.576161   .0512415    30.76   0.000     1.473795    1.678528
            _cons |   3.790108   .8777018     4.32   0.000     2.036697    5.543519
-----------------------------------------------------------------------------------

. gen matched3 = cem_matched==1

. **Keep only variables for merging**
. keep matched1 matched2 matched3 LAgroup 

. **Save matched dataset
. save  "Homelessness_QED_StayingPut_CEM1.dta", replace
file Homelessness_QED_StayingPut_CEM1.dta saved

. **Merge in outcomes dataset**
. merge 1:m LAgroup using "Outcomes_clean_QED.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            93
        from master                         0  (_merge==1)
        from using                         93  (_merge==2)

    matched                             1,825  (_merge==3)
    -----------------------------------------

. save "StayingPut_Analysis.dta", replace
file StayingPut_Analysis.dta saved

. log close 
      name:  <unnamed>
       log:  /Users/michaelsanders/Documents/Homelessness QED/Staying-Put_CEM.log
  log type:  text
 closed on:  11 Jan 2023, 19:28:14
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
